src/main/java/ru/vk/itmo/test/kovalchukvladislav/resources/wrk/get20000
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   707.98us  534.06us   5.70ms   82.51%
    Req/Sec    21.11k     1.93k   30.44k    73.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  650.00us
 75.000%    0.95ms
 90.000%    1.13ms
 99.000%    2.90ms
 99.900%    4.47ms
 99.990%    5.41ms
 99.999%    5.64ms
100.000%    5.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.020     0.000000            1         1.00
       0.157     0.100000        40161         1.11
       0.281     0.200000        80049         1.25
       0.404     0.300000       120059         1.43
       0.528     0.400000       160278         1.67
       0.650     0.500000       200026         2.00
       0.711     0.550000       220063         2.22
       0.772     0.600000       239978         2.50
       0.833     0.650000       260032         2.86
       0.894     0.700000       280182         3.33
       0.954     0.750000       300163         4.00
       0.984     0.775000       310179         4.44
       1.014     0.800000       320191         5.00
       1.044     0.825000       330219         5.71
       1.074     0.850000       340238         6.67
       1.104     0.875000       350223         8.00
       1.118     0.887500       354970         8.89
       1.133     0.900000       359978        10.00
       1.149     0.912500       365227        11.43
       1.164     0.925000       370020        13.33
       1.240     0.937500       374938        16.00
       1.373     0.943750       377449        17.78
       1.514     0.950000       379950        20.00
       1.661     0.956250       382438        22.86
       1.816     0.962500       384938        26.67
       1.975     0.968750       387439        32.00
       2.063     0.971875       388691        35.56
       2.159     0.975000       389954        40.00
       2.273     0.978125       391193        45.71
       2.419     0.981250       392431        53.33
       2.577     0.984375       393685        64.00
       2.663     0.985938       394321        71.11
       2.749     0.987500       394933        80.00
       2.841     0.989062       395562        91.43
       2.939     0.990625       396181       106.67
       3.047     0.992188       396809       128.00
       3.117     0.992969       397122       142.22
       3.199     0.993750       397431       160.00
       3.319     0.994531       397743       182.86
       3.479     0.995313       398054       213.33
       3.669     0.996094       398366       256.00
       3.769     0.996484       398524       284.44
       3.867     0.996875       398679       320.00
       3.957     0.997266       398835       365.71
       4.055     0.997656       398994       426.67
       4.163     0.998047       399150       512.00
       4.215     0.998242       399231       568.89
       4.275     0.998437       399305       640.00
       4.339     0.998633       399383       731.43
       4.407     0.998828       399462       853.33
       4.487     0.999023       399539      1024.00
       4.531     0.999121       399578      1137.78
       4.567     0.999219       399616      1280.00
       4.619     0.999316       399658      1462.86
       4.671     0.999414       399695      1706.67
       4.751     0.999512       399733      2048.00
       4.811     0.999561       399753      2275.56
       4.871     0.999609       399773      2560.00
       4.951     0.999658       399793      2925.71
       5.019     0.999707       399811      3413.33
       5.103     0.999756       399831      4096.00
       5.155     0.999780       399841      4551.11
       5.195     0.999805       399850      5120.00
       5.247     0.999829       399860      5851.43
       5.303     0.999854       399870      6826.67
       5.359     0.999878       399880      8192.00
       5.391     0.999890       399885      9102.22
       5.415     0.999902       399889     10240.00
       5.435     0.999915       399894     11702.86
       5.471     0.999927       399900     13653.33
       5.495     0.999939       399904     16384.00
       5.519     0.999945       399907     18204.44
       5.523     0.999951       399909     20480.00
       5.539     0.999957       399912     23405.71
       5.555     0.999963       399914     27306.67
       5.567     0.999969       399916     32768.00
       5.579     0.999973       399918     36408.89
       5.583     0.999976       399919     40960.00
       5.591     0.999979       399920     46811.43
       5.607     0.999982       399921     54613.33
       5.627     0.999985       399922     65536.00
       5.631     0.999986       399923     72817.78
       5.643     0.999988       399924     81920.00
       5.643     0.999989       399924     93622.86
       5.659     0.999991       399925    109226.67
       5.659     0.999992       399925    131072.00
       5.679     0.999993       399926    145635.56
       5.679     0.999994       399926    163840.00
       5.679     0.999995       399926    187245.71
       5.691     0.999995       399927    218453.33
       5.691     0.999996       399927    262144.00
       5.691     0.999997       399927    291271.11
       5.691     0.999997       399927    327680.00
       5.691     0.999997       399927    374491.43
       5.699     0.999998       399928    436906.67
       5.699     1.000000       399928          inf
#[Mean    =        0.708, StdDeviation   =        0.534]
#[Max     =        5.696, Total count    =       399928]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599993 requests in 30.00s, 39.48MB read
  Non-2xx or 3xx responses: 599993
Requests/sec:  19999.88
Transfer/sec:      1.32MB